In [7]:
# Dependencies, SQL alchemy

import sqlalchemy

import pandas as pd

import matplotlib.pyplot as plt

import numpy as np

In [8]:
# Engine and connection to database

engine = sqlalchemy.create_engine('postgresql://postgres:postgres@localhost:5432/EmployeeDatabase - Queries')

connection = engine.connect()

In [14]:
# read and display the table "titles"
titles_df = pd.read_sql_table("titles", engine)
titles_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [12]:
# read and display the table "salaries"
salary_df = pd.read_sql_table("salaries", engine)
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [22]:
# combine both dataframes 
merged_info = pd.concat([salary_df, titles_df])
merged_info.head()

    emp_no   salary title_id title
0  10001.0  60117.0      NaN   NaN
1  10002.0  65828.0      NaN   NaN
2  10003.0  40006.0      NaN   NaN
3  10004.0  40054.0      NaN   NaN
4  10005.0  78228.0      NaN   NaN